
*** Question 5
Given the 2D list, how would you print the value 3 using its index?

#+begin_src python :results output
my_list = [['a', 'b', 'c'], [1, 2, 3], ['d', 'e', 'f']]
print(my_list[1][2])
#+end_src

#+RESULTS:
: 3

*** Question 6
What will the following code set ~x~ to?

#+begin_src python :results output
  x = 26 % 4
  print(x)
#+end_src

#+RESULTS:
: 2

Correct! The remainder when dividing 26 by 4 is 2.

*** Question 7
What is returned when ~.find()~ is called on the following string?

#+begin_src python :results output
  str = "Yipeeee"
  print(str.find("e"))
#+end_src

#+RESULTS:
: 3

Correct! .find() only returns the first occurrence of the string passed to it.

*** Question 10
Write a function named first_three_multiples() that has one parameter named num.

This function should print the first three multiples of num. Then, it should return the third multiple.

For example, first_three_multiples(7) should print 7, 14, and 21 on three different lines, and return 21.

*Hint*
For this function, we need to print() out the results of each multiplication * then return a single value. For example, printing the result of 3 times 5 wouldo look like print(3 * 5) and returning it would look like return 3 * 5.

#+begin_src python :results output

  # Write your first_three_multiples function here
  def first_three_multiples(num):
      print(num)
      print(num * 2)
      print(num * 3)

      return print(num * 3)

  first_three_multiples(10)
#+end_src

#+RESULTS:
: 10
: 20
: 30
: 30

*** Question 15
Put a variable in the print() function which will not raise any error.

#+begin_src python :results output
  def get_prescription():
      advice = "Drink plenty of water."
      hospital_charge = 15
      return advice

  prescription = get_prescription()
  print(prescription)
#+end_src

#+RESULTS:
: Drink plenty of water.


*** Question 16
What is the value of the balance variable printed at last?

#+begin_src python :results output
  balance = 1000

  def withdraw(current_balance, amount):
      current_balance = current_balance - amount
      print('Withdrawing money.')
      return current_balance

  def deposit(current_balance, amount):
      current_balance = current_balance + amount
      print('Depositing money.')
      return current_balance

  balance = withdraw(balance, 100)
  balance = withdraw(balance, 50)
  balance = balance + 10
  balance = deposit(balance, 100)
  print(balance)
#+end_src

#+RESULTS:
: Withdrawing money.
: Withdrawing money.
: Depositing money.
: 960

